/*
*********************************************************************************************************
*
*	模块名称 : 硬件测试界面
*	文件名称 : hard_test.h
*	版    本 : V1.0
*
*	Copyright (C), 2013-2014, 安富莱电子 www.armfly.com
*
*********************************************************************************************************
*/

#ifndef _HARD_TEST_H_
#define _HARD_TEST_H_

extern void HardInfo(void);
extern void PrintfHardInfo(void);

#endif

/***************************** 安富莱电子 www.armfly.com (END OF FILE) *********************************/
