/*
*********************************************************************************************************
*
*    模块名称 : WEB服务器程序
*    文件名称 : http_server.h
*    版    本 : V1.0
*    说    明 : 头文件
*
*    Copyright (C), 2013-2014, 安富莱电子 www.armfly.com
*
*********************************************************************************************************
*/

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __HTTP_SERVER_H
#define __HTTP_SERVER_H

void WebServer(void);

#endif
