/*
*********************************************************************************************************
*
*	模块名称 : 主菜单模块
*	文件名称 : status_menu.h
*	版    本 : V1.0
*
*	Copyright (C), 2013-2014, 安富莱电子 www.armfly.com
*
*********************************************************************************************************
*/

#ifndef _STATUS_MENU_H_
#define _STATUS_MENU_H_

void status_MenuMain(void);

#endif

/***************************** 安富莱电子 www.armfly.com (END OF FILE) *********************************/

